# Ultralytics YOLOv8n model with an extra P2 detection head
# This variant keeps the original C2f blocks and only adds the P2 branch.

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C2f, [128]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, C2f, [256]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, C2f, [512]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C2f, [1024]]

neck:
  - [[3, 5, 7], 1, SPPCSPC, [512]]
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 5], 1, Concat, [1]]
  - [-1, 2, C2f, [512]]
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 3], 1, Concat, [1]]
  - [-1, 2, C2f, [256]]
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 1], 1, Concat, [1]]
  - [-1, 2, C2f, [128]]

head:
  - [[-1, 6, 8, 9], 1, Detect, [nc]]
